CSI API ETABS v1
cHelper.GetObjectProcess Method
 Attaches to the running instance of the program with the given process id.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI GetObjectProcess(
	string typeName,
	int pid
)
Function GetObjectProcess (
	typeName As String,
	pid As Integer
) As cOAPI
Dim instance As cHelper
Dim typeName As String
Dim pid As Integer
Dim returnValue As cOAPI
returnValue = instance.GetObjectProcess(typeName,
	pid)
cOAPI^ GetObjectProcess(
	String^ typeName,
	int pid
)
abstract GetObjectProcess :
        typeName : string *
        pid : int -> cOAPI
Parameters
typeName
Type: System.String
The program ID of the API object.
pid
Type: System.Int32
The system-generated unique identifier (process ID) of the desired instance of the program as shown in Windows Task Manager and/or under “Tools” menu.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim pid as Integer
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    pid = 1234 'set to process ID of the program instance to attach to
    EtabsObject = myHelper.GetObjectProcess("CSI.ETABS.API.ETABSObject", pid)
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace